/*
写一个函数，求两个整数之和，要求在函数体内不得使用 + 、 - 、 * 、 / 四则运算符号。
思路：
1. 两个数异或：相当于每一位相加，而不考虑进位；
2. 两个数相与，并左移一位：相当于求得进位；
3. 将上述两步的结果相加
循环处理，直到没有进位
1 + 2
0001 0001 ^ 0010 = 0011 == 2
0010 0001 & 0010 = 0
1 + 3
0001 0001 ^ 0011 = 0010 0010 0010 ^ 0010 = 0 0000
0011 0001 & 0011 = 0001 表示有进位 << 1 = 0010 0010 & 0010 = 0010 << 1 = 0100
0000 ^ 0100 = 0100 == 4
0000 & 0100 = 0
*/

#if 0
int Add(int num1, int num2) {
	while (num2 != 0) {
		int sum = num1 ^ num2;
		int carray = (num1 & num2) << 1;
		num1 = sum;
		num2 = carray;
	}
	return num1;
}
#endif